examples/EmberPaperCases/FenceHeight/72ft/aa_NoFenceNoHouse/a_windSim/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.2.0                                            |
|   A nd           | Web:      http://www.OpenFOAM.org                        |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains    3;

method           simple;

simpleCoeffs
{
    n                   (3 1 1 );
    delta               0.001;
}

hierarchicalCoeffs
{
    n               (2 1 1 );
    delta           0.001;
    order           xyz;
}

scotchCoeffs
{
    processorWeights
    (
        1 1 1 1 1 1
    );
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots
(
);

// ************************************************************************* //
